#+Author: Christoph Viehboeck
#+TITLE: GHDL Tutorial
#+EMAIL: s1810567023@students.fh-hagenberg.at

#+OPTIONS: tex:t latex:t tex:verbatim
#+OPTIONS: ':t -:t toc:nil ^:nil

#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+REVEAL_HLEVEL: 1
#+REVEAL_TRANS: fade
#+REVEAL_THEME: simple

** Structure
Folder Structure of the Project.

#+BEGIN_SRC shell :exports results
tree -L 1 ..
#+END_SRC

#+RESULTS:
| ..  |              |   |       |
| ├── | doc          |   |       |
| ├── | labs         |   |       |
| ├── | packs        |   |       |
| ├── | presentation |   |       |
| └── | scripts      |   |       |
| 5   | directories, | 0 | files |

* Usage
For the correct Usage of the Simulators follow the
instructions. Source code is located in the labs folder.

#+BEGIN_SRC shell :exports results
ls ../labs
#+END_SRC

#+RESULTS:
| lab10_veri_gen_vhdl     |
| lab11_veri_vpi          |
| lab1_simple_ghdl        |
| lab2_simple_makefile    |
| lab3_big_unit           |
| lab4_adder_codecoverage |
| lab5_psl_example        |
| lab6_vhpi_example       |
| lab7_vhdl_access_c      |
| lab8_vhdl_direct_c      |
| lab9_veri_adder         |

The labs folder contains in sum 11 labs for working with the open
source vhdl and verilog simulators.

*** Files

#+BEGIN_SRC shell :exports results
ls ../labs/lab1_simple_ghdl
#+END_SRC

#+RESULTS:
| commands.txt            |
| simple_logic-e.vhd      |
| simple_logic-rtl-a.vhd  |
| simple_logic-tb_beh.vhd |

The file commands contains all commands which have to be typed into
the console for the analyzing and the elaboration of the design. Ghdl
creates a executeable after the elaboration.

*** commands

#+BEGIN_SRC shell :exports results
cat ../labs/lab1_simple_ghdl/commands.txt
#+END_SRC

#+RESULTS:
| ghdl | -a | simple_logic-e.vhd      |
| ghdl | -a | simple_logic-rtl-a.vhd  |
| ghdl | -a | simple_logic-tb.vhd     |
| ghdl | -a | simple_logic-tb_beh.vhd |
| ghdl | -e | simple_logic_tb         |

** lab4_adder_codecoverage
Be aware only the gcc backend compiled with the simulator ghdl is able
to generate the code coverage report of vhdl files.

#+BEGIN_SRC shell :exports both
ghdl -v
#+END_SRC

#+RESULTS:
| GHDL      | 0.37-dev | (v0.36-128-gd229e16e) | [Dunoon   | edition]        |         |          |     |         |            |          |       |    |    |
| Compiled  | with     | GNAT                  | Version:  | 8.3.0           |         |          |     |         |            |          |       |    |    |
| GCC       | back-end | code                  | generator |                 |         |          |     |         |            |          |       |    |    |
| Written   | by       | Tristan               | Gingold.  |                 |         |          |     |         |            |          |       |    |    |
| Copyright | (C)      | 2003                  | 0         | 2019            | Tristan | Gingold. |     |         |            |          |       |    |    |
| GHDL      | is       | free                  | software, | covered         | by      | the      | GNU | General | Public     | License. | There | is | NO |
| warranty; | not      | even                  | for       | MERCHANTABILITY | or      | FITNESS  | FOR | A       | PARTICULAR | PURPOSE. |       |    |    |

Make sure your ghdl version is compiled with the gcc backend or use
the script for compiling ghdl with gcc in the scripts folder.

#+BEGIN_SRC shell :exports code
../scripts/ghdl_gcc_backend.sh
#+END_SRC

The script installs ghdl with gcc-backend version 8.3.0 now make sure
the gcov tool is installed with the same version and try executing the
scripts in the lab folder.

#+BEGIN_SRC shell :exports results
ls ../labs/lab4_adder_codecoverage | grep -i ".sh"
#+END_SRC

#+RESULTS:
| clean.sh  |
| cover.sh  |

After creation open the generated index.html file with your favourite
browser. Navigate to the unit and check the code coverage.

